
import random

number = random.randint(1, 101)

print(number)  # любое число от 1 до 100 включительно

# venv\Scripts\activate
# команда чтобы активировать вирт. окружение в Windows


"""
1. Проверка на палиндром:
Пользователь вводит строку, а программа определяет, является ли она палиндромом. Палиндром - это строка, которая читается одинаково как слева направо, так и справа налево.
 2. Определение сезона по номеру месяца:
Пользователь вводит номер месяца, а программа выводит название соответствующего сезона. Например, если пользователь вводит 2, программа выводит 'Зима'.
 3. Арифметический калькулятор:
Пользователь вводит два целых числа и оператор (+, -, / или *), а программа вычисляет и выводит результат соответствующей арифметической операции. Например, если пользователь вводит: 7, 3, *, программа выводит 21.
 4. Вывод чётных чисел:
Пользователь вводит целое положительное число, а программа выводит на экран все чётные числа, не превышающие введённое число. (Необходимо реализовать через функцию-процедуру, которая не возвращает значение).
 5. Проверка на простое число:
Пользователь вводит число, а программа определяет, является ли оно простым. Простое число - это натуральное число больше 1, которое не имеет положительных делителей, кроме 1 и самого себя. Если число простое, программа печатает "Ваше число простое", иначе "Ваше число НЕпростое".

Примечание: Для каждой задачи необходимо создать папку, в которых будут три файла: __init__.py, helper_functions.py, main.py.
В __init__.py следует написать условие задачи в виде комментария. (*данный init.py файл позволяет сделать “питоновский пакет” из обычной папки. Я вам позже объясню более детальнее, сейчас это не суть важна)
В helper_functions.py нужно создать функцию, желательно добавив докстринг и аннотации типов.
И в main.py принять значение от пользователя и вызвать функцию из helper_functions.py.

ПОЖАЛУЙСТА, не просто решите эти задачи, а решите “красиво” в стиле питона. Именуйте ваши переменные правильно/понятно и именуйте ваши функции тоже понятными глаголами. Используйте англо-русский переводчик.
"""
